In [1]:
import pandas as pd

In [ ]:
new_cust = pd.read_excel('KPMG_VI_New_raw_data_update_final.xlsx', sheet_name = 'NewCustomerList', header = 1)

In [3]:
new_cust

,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,...,state,country,property_valuation,Unnamed: 16,Unnamed: 17,Unnamed: 18,Unnamed: 19,Unnamed: 20,Rank,Value
0,Chickie,Brister,Male,86,1957-07-12,General Manager,Manufacturing,Mass Customer,N,Yes,...,QLD,Australia,6,0.56,0.7000,0.875000,0.743750,1,1,1.718750
1,Morly,Genery,Male,69,1970-03-22,Structural Engineer,Property,Mass Customer,N,No,...,NSW,Australia,11,0.89,0.8900,1.112500,0.945625,1,1,1.718750
2,Ardelis,Forrester,Female,10,1974-08-28,Senior Cost Accountant,Financial Services,Affluent Customer,N,No,...,VIC,Australia,5,1.01,1.0100,1.010000,1.010000,1,1,1.718750
3,Lucine,Stutt,Female,64,1979-01-28,Account Representative III,Manufacturing,Affluent Customer,N,Yes,...,QLD,Australia,1,0.87,1.0875,1.087500,1.087500,4,4,1.703125
4,Melinda,Hadlee,Female,34,1965-09-21,Financial Analyst,Financial Services,Affluent Customer,N,No,...,NSW,Australia,9,0.52,0.5200,0.650000,0.650000,4,4,1.703125
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,Ferdinand,Romanetti,Male,60,1959-10-07,Paralegal,Financial Services,Affluent Customer,N,No,...,NSW,Australia,7,0.79,0.7900,0.790000,0.790000,996,996,0.374000
996,Burk,Wortley,Male,22,2001-10-17,Senior Sales Associate,Health,Mass Customer,N,No,...,NSW,Australia,10,0.76,0.7600,0.950000,0.807500,997,997,0.357000
997,Melloney,Temby,Female,17,1954-10-05,Budget/Accounting Analyst IV,Financial Services,Affluent Customer,N,Yes,...,QLD,Australia,2,0.85,1.0625,1.062500,1.062500,997,997,0.357000
998,Dickie,Cubbini,Male,30,1952-12-17,Financial Advisor,Financial Services,Mass Customer,N,Yes,...,QLD,Australia,2,1.09,1.3625,1.362500,1.158125,997,997,0.357000
999,Sylas,Duffill,Male,56,1955-10-02,Staff Accountant IV,Property,Mass Customer,N,Yes,...,NSW,Australia,9,0.47,0.5875,0.734375,0.624219,1000,1000,0.340000

In [4]:
new_cust.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 23 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   first_name                           1000 non-null   object
 1   last_name                            971 non-null    object
 2   gender                               1000 non-null   object
 3   past_3_years_bike_related_purchases  1000 non-null   int64
 4   DOB                                  983 non-null    datetime64[ns]
 5   job_title                            894 non-null    object
 6   job_industry_category                835 non-null    object
 7   wealth_segment                       1000 non-null   object
 8   deceased_indicator                   1000 non-null   object
 9   owns_car                             1000 non-null   object
 10  tenure                               1000 non-null   int64
 11  address                              1000 non-null   object
 12  postcode                             1000 non-null   int64
 13  state                                1000 non-null   object
 14  country                              1000 non-null   object
 15  property_valuation                   1000 non-null   int64
 16  Unnamed: 16                          1000 non-null   float64
 17  Unnamed: 17                          1000 non-null   float64
 18  Unnamed: 18                          1000 non-null   float64
 19  Unnamed: 19                          1000 non-null   float64
 20  Unnamed: 20                          1000 non-null   int64
 21  Rank                                 1000 non-null   int64
 22  Value                                1000 non-null   float64
dtypes: datetime64[ns](1), float64(5), int64(6), object(11)
memory usage: 179.8+ KB

In [5]:
new_cust = new_cust.drop(columns = ['Unnamed: 16','Unnamed: 17','Unnamed: 18','Unnamed: 19','Unnamed: 20',])

In [6]:
new_cust.duplicated().sum()

0

In [7]:
new_cust.isnull().sum()

first_name                               0
last_name                               29
gender                                   0
past_3_years_bike_related_purchases      0
DOB                                     17
job_title                              106
job_industry_category                  165
wealth_segment                           0
deceased_indicator                       0
owns_car                                 0
tenure                                   0
address                                  0
postcode                                 0
state                                    0
country                                  0
property_valuation                       0
Rank                                     0
Value                                    0
dtype: int64

In [8]:
new_cust = new_cust.dropna(subset = ['DOB','job_industry_category'])
new_cust['last_name'] = new_cust['last_name'].fillna('')
new_cust['job_title'] = new_cust['job_title'].fillna('other')

In [9]:
new_cust.isnull().sum()

first_name                             0
last_name                              0
gender                                 0
past_3_years_bike_related_purchases    0
DOB                                    0
job_title                              0
job_industry_category                  0
wealth_segment                         0
deceased_indicator                     0
owns_car                               0
tenure                                 0
address                                0
postcode                               0
state                                  0
country                                0
property_valuation                     0
Rank                                   0
Value                                  0
dtype: int64

In [10]:
new_cust.nunique()

first_name                             778
last_name                              788
gender                                   2
past_3_years_bike_related_purchases    100
DOB                                    802
job_title                              179
job_industry_category                    9
wealth_segment                           3
deceased_indicator                       1
owns_car                                 2
tenure                                  22
address                                818
postcode                               469
state                                    3
country                                  1
property_valuation                      12
Rank                                   306
Value                                  306
dtype: int64

In [11]:
new_cust['gender'].value_counts()

Female    428
Male      390
Name: gender, dtype: int64

In [12]:
new_cust['DOB'].value_counts()

1951-11-28    2
1974-12-25    2
1963-08-25    2
1992-10-13    2
1987-01-15    2
             ..
1969-10-09    1
1968-12-11    1
1951-11-27    1
1939-12-22    1
1955-10-02    1
Name: DOB, Length: 802, dtype: int64

In [14]:
new_cust.insert(loc = new_cust.columns.get_loc('DOB')+1, column = 'Age',value = '')
today = pd.Timestamp.today()
new_cust['Age'] = (today- new_cust['DOB']).astype('timedelta64[Y]')
new_cust['Age'].sort_values(ascending = False)

689    84.0
885    84.0
797    84.0
585    84.0
406    84.0
       ...
475    21.0
742    21.0
996    21.0
843    21.0
141    21.0
Name: Age, Length: 818, dtype: float64

In [15]:
new_cust['job_industry_category'].value_counts()

Financial Services    202
Manufacturing         199
Health                152
Retail                 78
Property               64
Entertainment          36
IT                     36
Argiculture            26
Telecommunications     25
Name: job_industry_category, dtype: int64

In [16]:
new_cust['wealth_segment'].value_counts()

Mass Customer        414
High Net Worth       206
Affluent Customer    198
Name: wealth_segment, dtype: int64

In [17]:
new_cust['deceased_indicator'].value_counts()

N    818
Name: deceased_indicator, dtype: int64

In [18]:
new_cust['owns_car'].value_counts()

No     416
Yes    402
Name: owns_car, dtype: int64

In [19]:
new_cust['state'].value_counts()

NSW    413
VIC    217
QLD    188
Name: state, dtype: int64

In [20]:
new_cust['country'].value_counts()

Australia    818
Name: country, dtype: int64

In [21]:
new_cust['property_valuation'].value_counts()

9     140
8     128
10    105
7     101
6      59
11     50
5      44
4      44
2      41
3      41
12     38
1      27
Name: property_valuation, dtype: int64

In [22]:
new_cust

,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,Age,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,tenure,address,postcode,state,country,property_valuation,Rank,Value
0,Chickie,Brister,Male,86,1957-07-12,65.0,General Manager,Manufacturing,Mass Customer,N,Yes,14,45 Shopko Center,4500,QLD,Australia,6,1,1.718750
1,Morly,Genery,Male,69,1970-03-22,52.0,Structural Engineer,Property,Mass Customer,N,No,16,14 Mccormick Park,2113,NSW,Australia,11,1,1.718750
2,Ardelis,Forrester,Female,10,1974-08-28,48.0,Senior Cost Accountant,Financial Services,Affluent Customer,N,No,10,5 Colorado Crossing,3505,VIC,Australia,5,1,1.718750
3,Lucine,Stutt,Female,64,1979-01-28,44.0,Account Representative III,Manufacturing,Affluent Customer,N,Yes,5,207 Annamark Plaza,4814,QLD,Australia,1,4,1.703125
4,Melinda,Hadlee,Female,34,1965-09-21,57.0,Financial Analyst,Financial Services,Affluent Customer,N,No,19,115 Montana Place,2093,NSW,Australia,9,4,1.703125
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,Ferdinand,Romanetti,Male,60,1959-10-07,63.0,Paralegal,Financial Services,Affluent Customer,N,No,9,2 Sloan Way,2200,NSW,Australia,7,996,0.374000
996,Burk,Wortley,Male,22,2001-10-17,21.0,Senior Sales Associate,Health,Mass Customer,N,No,6,04 Union Crossing,2196,NSW,Australia,10,997,0.357000
997,Melloney,Temby,Female,17,1954-10-05,68.0,Budget/Accounting Analyst IV,Financial Services,Affluent Customer,N,Yes,15,33475 Fair Oaks Junction,4702,QLD,Australia,2,997,0.357000
998,Dickie,Cubbini,Male,30,1952-12-17,70.0,Financial Advisor,Financial Services,Mass Customer,N,Yes,19,57666 Victoria Way,4215,QLD,Australia,2,997,0.357000
999,Sylas,Duffill,Male,56,1955-10-02,67.0,Staff Accountant IV,Property,Mass Customer,N,Yes,14,21875 Grover Drive,2010,NSW,Australia,9,1000,0.340000

In [23]:
new_cust.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 818 entries, 0 to 999
Data columns (total 19 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   first_name                           818 non-null    object
 1   last_name                            818 non-null    object
 2   gender                               818 non-null    object
 3   past_3_years_bike_related_purchases  818 non-null    int64
 4   DOB                                  818 non-null    datetime64[ns]
 5   Age                                  818 non-null    float64
 6   job_title                            818 non-null    object
 7   job_industry_category                818 non-null    object
 8   wealth_segment                       818 non-null    object
 9   deceased_indicator                   818 non-null    object
 10  owns_car                             818 non-null    object
 11  tenure                               818 non-null    int64
 12  address                              818 non-null    object
 13  postcode                             818 non-null    int64
 14  state                                818 non-null    object
 15  country                              818 non-null    object
 16  property_valuation                   818 non-null    int64
 17  Rank                                 818 non-null    int64
 18  Value                                818 non-null    float64
dtypes: datetime64[ns](1), float64(2), int64(5), object(11)
memory usage: 127.8+ KB

In [24]:
new_cust.to_csv('New_Cust_Cleaned.csv',index = False)